## Lambda 
- lambda function
- lambda expression
- annonymous function
- nameless function

In [1]:
def cel2fah(c):
    return (c * (9 / 5)) + 32

In [2]:
cel2fah(100)

212.0

In [3]:
cel2fah(0)

32.0

In [4]:
lambda c: (c * (9 / 5)) + 32

In [5]:
c2f = lambda c: (c * (9 / 5)) + 32

In [6]:
c2f(100)

212.0

In [7]:
t = [0,10,20,30,100]

In [8]:
def cel2fah(c):
    return (c * (9 / 5)) + 32 

f = map(lambda c: cel2fah(c), t)
list(f)

[32.0, 50.0, 68.0, 86.0, 212.0]

In [9]:
f2 = map(lambda c: (c * (9 / 5)) + 32 , t)
list(f2)

[32.0, 50.0, 68.0, 86.0, 212.0]

In [10]:
rectangle = lambda w, h: w*h

In [11]:
rectangle(5,10)

50

### lambda function in pandas

In [24]:
import pandas as pd
pd.__version__

'1.1.3'

In [13]:
df = pd.DataFrame({'celsius' : t})
df

   celsius
0        0
1       10
2       20
3       30
4      100

In [14]:
df.celsius * 9/5 + 32

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [15]:
df.celsius.map(lambda c: c*9/5+32)

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [20]:
df.celsius.apply(lambda c: c*9/5+32)

0     32.0
1     50.0
2     68.0
3     86.0
4    212.0
Name: celsius, dtype: float64

In [18]:
%timeit -n1000 df.celsius * 9/5 + 32

581 µs ± 24.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [19]:
%timeit -n1000 df.celsius.map(lambda c: c*9/5+32)

256 µs ± 14.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [21]:
%timeit -n1000 df.celsius.apply(lambda c: c*9/5+32)

121 µs ± 14.9 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [22]:
df['fah'] = df.celsius.apply(lambda c: c*9/5+32) #map ก็ให้ output เดียวกันกับใช้ apply
df

   celsius    fah
0        0   32.0
1       10   50.0
2       20   68.0
3       30   86.0
4      100  212.0

### Example

In [23]:
df2 = pd.read_table('https://github.com/prasertcbs/tutorial/raw/master/applicant.tsv')
df2

  applicantID  eng  math  interview
0        A432   91    97         83
1        C747   94    94         58
2        C751   74    55         89
3        B716   63    89         93
4        A623   90    73         81
5        B394   76    91         90
6        A294   90    86         94
7        B318   62    57         55
8        B164   79    57         89
9        A126   89    82         85

In [26]:
df2.eng.map(lambda s: 'pass' if s >= 80 else 'fail')

0    pass
1    pass
2    fail
3    fail
4    pass
5    fail
6    pass
7    fail
8    fail
9    pass
Name: eng, dtype: object

In [31]:
df2.apply(lambda s: 'pass' if s.eng >= 80 and s.math >= 75 else 'fail',axis=1)

0    pass
1    pass
2    fail
3    fail
4    fail
5    fail
6    pass
7    fail
8    fail
9    pass
dtype: object

In [30]:
df2['eng_math'] = df2.apply(lambda s: 'pass' if s.eng >= 80 and s.math >= 75 else 'fail',axis=1)
df2

  applicantID  eng  math  interview eng_math
0        A432   91    97         83     pass
1        C747   94    94         58     pass
2        C751   74    55         89     fail
3        B716   63    89         93     fail
4        A623   90    73         81     fail
5        B394   76    91         90     fail
6        A294   90    86         94     pass
7        B318   62    57         55     fail
8        B164   79    57         89     fail
9        A126   89    82         85     pass

In [33]:
df2['qualify'] = df2.apply(lambda s: 'pass' if s.eng >= 80 and s.math >= 75 and s.interview > 60 else 'fail',axis=1)
df2

  applicantID  eng  math  interview eng_math qualify
0        A432   91    97         83     pass    pass
1        C747   94    94         58     pass    fail
2        C751   74    55         89     fail    fail
3        B716   63    89         93     fail    fail
4        A623   90    73         81     fail    fail
5        B394   76    91         90     fail    fail
6        A294   90    86         94     pass    pass
7        B318   62    57         55     fail    fail
8        B164   79    57         89     fail    fail
9        A126   89    82         85     pass    pass

In [34]:
df2.apply(lambda s: s.eng * 0.5 + s.math * 0.3 + s.interview * 0.2 , axis=1)

0    91.2
1    86.8
2    71.3
3    76.8
4    83.1
5    83.3
6    89.6
7    59.1
8    74.4
9    86.1
dtype: float64

In [36]:
df2['score'] = df2.apply(lambda s: s.eng * 0.5 + s.math * 0.3 + s.interview * 0.2 , axis=1)
df2

  applicantID  eng  math  interview eng_math qualify  score
0        A432   91    97         83     pass    pass   91.2
1        C747   94    94         58     pass    fail   86.8
2        C751   74    55         89     fail    fail   71.3
3        B716   63    89         93     fail    fail   76.8
4        A623   90    73         81     fail    fail   83.1
5        B394   76    91         90     fail    fail   83.3
6        A294   90    86         94     pass    pass   89.6
7        B318   62    57         55     fail    fail   59.1
8        B164   79    57         89     fail    fail   74.4
9        A126   89    82         85     pass    pass   86.1

In [41]:
df2['score2'] = df2.eng * 0.5 + df2.math * 0.3 + df2.interview * 0.2
df2

  applicantID  eng  math  interview eng_math qualify  score  score2
0        A432   91    97         83     pass    pass   91.2    91.2
1        C747   94    94         58     pass    fail   86.8    86.8
2        C751   74    55         89     fail    fail   71.3    71.3
3        B716   63    89         93     fail    fail   76.8    76.8
4        A623   90    73         81     fail    fail   83.1    83.1
5        B394   76    91         90     fail    fail   83.3    83.3
6        A294   90    86         94     pass    pass   89.6    89.6
7        B318   62    57         55     fail    fail   59.1    59.1
8        B164   79    57         89     fail    fail   74.4    74.4
9        A126   89    82         85     pass    pass   86.1    86.1

In [42]:
%timeit -n100 df2.apply(lambda s: s.eng * 0.5 + s.math * 0.3 + s.interview * 0.2 , axis=1)

570 µs ± 43.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [43]:
%timeit -n100 df2.eng * 0.5 + df2.math * 0.3 + df2.interview * 0.2

462 µs ± 75.8 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)